# 2.1. Простое сообщение. Сохраните текстовое сообщение в переменной и выведите его на экран.

msg = "2.1. It's a printed message"
print(msg)

# 2.2. Простые сообщения. Сохраните сообщение в переменной и выведите его.
# Затем замените значение переменной другим сообщением и выведите это новое сообщение.
msg = "2.2. it's time to upgrade msg"
print(msg)

# 2.3. Личное сообщение. Сохраните имя пользователя в переменной и выведите сообщение, предназначенное для конкретного человека.
# Сообщение должно быть простым, например: «Здравствуйте, Эрик, не хотите ли вы изучить Python сегодня?»

name = "Paul Rieter"
print(f"2.3. Dear {name}! Welcome to Python!")

# 2.4. Регистр символов в именах. Сохраните имя пользователя в переменной и выведите его в нижнем регистре,
# верхнем регистре и с капитализацией начальных букв каждого слова.

new_name = "Dow Jones"
print(f"2.4. {new_name.title()}\n     {new_name.upper()}\n     {new_name.lower()}")

# 2.5. Знаменитая цитата. Найдите известное высказывание, которое вам понравилось.
# Выведите текст цитаты с именем автора. Результат должен выглядеть примерно так (включая кавычки):
# Альберт Эйнштейн однажды сказал: «Тот, кто никогда не совершал ошибок, никогда не пробовал ничего нового».


# 2.6. Знаменитая цитата 2. Повторите упражнение 2.5, однако на этот раз сохраните имя автора цитаты в переменной famous_person.
# Затем составьте сообщение и сохраните его в новой переменной message. Выведите свое сообщение.

# 2.7. Удаление пробельных символов. Сохраните имя пользователя в переменной.
# Добавьте в начале и конце имени несколько пробельных символов.
# Проследите за тем, чтобы каждая последовательность символов "\t" и "\n" встречалась по крайней мере один раз.
# Выведите имя, чтобы были видны пробельные символы в начале и конце строки.
# Затем выведите его снова, используя каждую из функций удаления пробельных символов: lstrip(), rstrip() и strip().

# 2.8. Расширения файлов. В Python доступен метод removesuffix(), функционирующий точно так же, как removeprefix().
# Присвойте переменной filename значение 'python_notes.txt'.
# Затем используйте метод removesuffix(), чтобы отобразить имя файла без расширения,
# как это делают некоторые файловые браузеры.

# 2.9. Число 8. Напишите операции сложения, вычитания, умножения и деления, результатом которых является число 8.
# Не забудьте заключить операции в функции print(), чтобы проверить результат.
# Вы должны написать четыре строки кода, которые выглядят примерно так:
# print(5 + 3)
# Результатом должны быть четыре строки, в каждой из которых выводится число 8.

# 2.10. Любимое число. Сохраните свое любимое число в переменной.
# Затем с помощью переменной создайте сообщение для вывода этого числа. Выведите данное сообщение.

# 2.11. Добавление комментариев. Выберите две программы из написанных вами и добавьте в каждую хотя бы один комментарий.
# Если вы не найдете, что написать в комментариях, поскольку программы были слишком просты,
# то укажите свое имя и текущую дату в начале кода.
# Затем добавьте одно предложение с описанием того, что делает программа.

# 2.12. Дзен Python. Введите команду import this в терминальном сеансе Python и просмотрите другие принципы.
